Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: does it prevent oxygen from getting to the fire ?
af: het dit verhoed dat suurstof by die vuur uitkom ?

source: lots of interesting questions can arise here that could lead to a valuable discussion .
af: dit kan lei tot baie interessante vrae wat weer tot belangrike besprekings kan lei .

source: no mention need should be made of carbon dioxide unless the idea has already been raised before this .
af: jy moenie hoef nie koolstofdioksied te noem tensy die konsep alreeds vroe&#235;r bespreek is nie .

source: what causes of fire can you identify in your community ?
af: watter oorsake van brande kan jy in jou gemeenskap identifiseer ?

source: how could you prevent each of the causes of fire you have been discussing ?
af: hoe kan jy elkeen van hierdie oorsake van brande wat jy bespreek het voorkom ?

source: the answers to these questions are unique to the community in which you live .
af: die antwoorde op die vrae is uniek tot die gemeenskap waarin jy woon .

source: discuss the answers each group has come up with with the class .
af: bespreek elke groep se antwoorde met die klas .

source: suggest that each group makes a poster about fire safety after the class discussion .
af: stel voor dat elke groep 'n plakkaat oor vuur en veiligheid maak n&#225; die klasbespreking .

source: sometimes fires break out and it is important for us to know what to do in the event of a fire .
af: soms onstaan brande en dit is belangrik dat ons weet wat om in so 'n geval te doen .

source: the following actions should be shown in the plays
af: die volgende aksies moet in die opvoerings gewys word

source: to escape from a building fall and crawl .
af: om uit 'n gebou te onstnap &#8211; val en kruip .

source: when clothes are on fire stop drop and roll or cover in a blanket or carpet .
af: wanneer jou klere aan die brand is &#8211; stop val en rol of maak met 'n kombers of 'n mat toe .

source: if a friend is in a building learners should show that they never go into the building themselves but rather call for help .
af: as 'n vriend in die gebou vassit &#8211; leerders moet wys dat hulle nooit self in 'n brandende gebou sal ingaan nie maar eerder om hulp sal roep .

source: assess the learners' plays as a group according to how clearly the learners speak and demonstrate the actions to do with their bodies and by acting out .
af: asseseer die leerders se opvoerings as 'n groep volgens hoe duidelik hulle praat en hoe hulle die nodige aksies met hylle lywe en optrede uitbeeld .

source: have you ever seen any fire posters in your school telling you what to do in case of a fire ?
af: het jy al brandplakkate in jou skool gesien wat vir jou s&#234; wat om te doen as daar 'n brand is ?

source: did this poster catch your attention and make you aware of the dangers that fire can hold in your school ?
af: het die plakkaat jou aandag getrek en jou bewus gemaak van die gevare wat vuur inhou vir jou skool ?

source: maybe your school does not have any fire posters .
af: miskien is daar nie brandplakkate in jou skool nie .

source: let's create our own fire posters to put up in the school .
af: kom ons maakons eie plakkate om in die skool op te sit .

source: extra precautions are to close windows and doors .
af: ekstra maatre&#235;ls sal wees om die vensters en deure toe te maak .

source: smoke inhalation breathing in the harmful smoke from a fire kills more people in household or domestic fires than the actual fire does .
af: rookinaseming inasem van skadelike rook van 'n vuur maak meer mense dood in huishoudelike brande as die vuur self .

source: list three types of fuel that you use in your community .
af: lys drie soorte brandstof wat jy in jou gemeenskap gebruik .

source: food coal any fuel that the learners have experienced
af: kos steenkool enige brandstof wat leerders al gebruik het .

source: what is needed for combustion to take place ?
af: wat is nodig vir verbranding ?

source: heat fuel and oxygen
af: hitte brandstof en suurstof .

source: your dad is cooking with hot oil on the stove .
af: jou pa kook met warm olie op die stoof .

source: the oil catches fire .
af: die olie slaan aan die brand .

source: suggest a way to put out the fire and explain why it will work .
af: wat kan hy doen om die vuur te blus ?

source: put the lid on the pot .
af: sit die deksel op die pot .

source: this will cut off the oxygen needed to burn and the fire will go out .
af: dit sal die suurstof afsny wat die vuur nodig het om te brand en die vuur sal doodgaan .

source: do not use water to put out an oil fire .
af: moenie water gebruik om die vuur te blus nie .

source: draw a line of best fit on your graph .
af: trek die gepaste lyn vir jou grafiek .

source: line must not join the points .
af: die lyn moenie die punte verbind nie .

source: must be a line drawn with a ruler that is as close to the data points as possible .
af: die lyn moet met 'n liniaal getrek word en so na as moontlik aan die datapunte wees .

source: there should be as many data points above the line as below .
af: daar moet net soveel datapunte onder die lyn wees as bo die lyn .

source: describe the relationship between the time of burn and the number of firelighters .
af: beskryf die verwantskap tussen die tyd van verbranding en die aantal aanstekers .

source: the greater the number of firelighters the greater the burn time .
af: hoe groter die aantal aanstekers hoe langer brand dit .

source: use your graph to find out how long ten firelighters would burn for .
af: gebruik jou grafiek om uit te vind hoe lank tien aanstekers sal brand .

source: your mom leaves the iron on and it is next to a window with a curtain blowing in the wind .
af: jou ma los die strykyster aan en dit is langs 'n venster met 'n gordyn wat in die wind waai .

source: explain to her why this is dangerous and what she should rather do .
af: verduidelik aan haar hoekom dit gevaarlik is en wat sy eerder moet doen .

source: the curtain could blow against the hot iron and catch fire and burn the house down .
af: die gordyn kan teen die warm strykyster vaswaai en aan die brand raak en ook die hele huis laat afbrand .

source: the wind blowing in from the window would also help to spread the fire .
af: die wind wat deur die venster waai sal ook help om die vuur te versprei .

source: she should rather turn the iron off when not using it and close the window so the curtain does not blow against the iron .
af: sy moet liewer die strykyster afsit wanneer sy dit nie gebruik nie en die venster toemaak sodat die gordyn nie teen die strykyster kan waai nie .

source: batteries come in all shapes and sizes .
af: batterye kom voor in allerhande vorms en groottes .

source: batteries are needed for many different purposes .
af: ons het batterye wat vir verskillende doeleindes benodig word .

source: most torches radios calculators cell phones some toys and even cars pacemakers and hearing aids need batteries to work .
af: meeste flitsligte radio's optelmasjientjies selfone sommige speelgoed en selfs motorvoertuie pasaange&#235;rs en gehoortoestelle het batterye nodig om te werk .

source: batteries are useful because they store chemical energy .
af: batterye is bruikbaar omdat dit chemiese energie kan stoor .

source: when the battery is connected in an electrical appliance and the appliance is switched on the stored energy in the battery is transferred to the appliance in the form of electrical energy to make it work .
af: wanneer die battery aan 'n elektriese apparaat gekoppel en dit aangeskakel word verander die gebergde energie in die battery na elektriese energie wat gebruik word sodat die apparaat kan werk .

source: does the bulb light up when there are no batteries in the torch ?
af: gaan die lig van die flits aan wanneer daar geen battery in is nie ?

source: what does this tell you about the need for batteries to make your torch work ?
af: hoekom is batterye nodig om jou flits te laat werk in die donker ?

source: you need batteries for the light bulb to light up .
af: jy benodig batterye vir die gloeilamp om te brand .

source: this is because the batteries are the source of electrical energy .
af: dit is omdat die selle die bron van elektriese energie is .

source: do you remember learning about transfer of energy in gr 4 ?
af: onthou jy wat jy in graad 4 geleer het oor die oordrag van energie ?

source: when the torch lights up what is the chemical energy in the battery transferred to ?
af: in watter vorm van energie verander die chemiese energie as die gloeilamp aangeskakel word ?

source: chemical energy in the batteries is transferred into electrical energy .
af: chemiese energie in die batterye word omgeskakel na elektriese energie .

source: electrical energy is then converted into light energy in the bulb .
af: elektriese energie word dan omgeskakel in ligenergie in die gloeilamp .

source: bring an old torch to school that can be taken apart .
af: bring 'n ou flits wat uitmekaar gehaal kan word skooltoe .

source: look carefully at all the parts that make up a torch and make a list of what you find .
af: kyk versigtig na al die dele van die flits en maak 'n lys van dit wat jy kry .

source: each part of the torch is needed for the torch to work properly .
af: elke deel van die flits is nodig om die flits reg te laat werk .

source: batteries light globe wires switch casing glass or plastic front
af: batterye gloeilamp drade skakelaar glas of plastiek voorkant .

source: an electric circuit is a system that consists of different parts .
af: 'n elektriese stroombaan is 'n stelsel wat uit verskillende dele bestaan .

source: we call these parts the components of the circuit .
af: ons noem die deeltjies die komponente van die stroombaan .

source: for example batteries light bulbs and connecting wires are components that can make up a circuit .
af: batterye gloeilampe en elektriese bedrading is byvoorbeeld komponente wat 'n stroombaan kan vorm .

source: when these components are connected the right way electricity will be transferred from one component to another .
af: wanneer die komponente reg met mekaar verbind word sal elektrisiteit oorgedra word van die een komponent na die volgende .

source: in this example the electricity would be transferred from the batteries through the connecting wire to the bulb and back through the wire to the batteries to complete the circuit .
af: in die voorbeeld word energie oorgedra van die batterye deur die verbindingsdrade na die gloeilamp en terug na die batterye om die stroombaan te voltooi .

source: part 1
af: deel 1

source: what do you observe ?
af: wat neem jy waar ?

source: the globe lights up .
af: die gloeilamp brand .

source: what happens when you disconnect one end of one of the wires ?
af: wat gebeur wanneer jy een van die punte van die drade losmaak ?

source: the light goes out .
af: die gloeilamp gaan dood .

source: the one end of the battery is labelled positive and the other end is negative .
af: die een kant van die battery is positief gemerk en die ander kant negatief .

source: draw a diagram of the battery and label the ends as positive or negative .
af: teken 'n diagram van die battery en merk die punte as positief of negatief .

source: part 2
af: deel 2

source: set up a new circuit with 2 batteries and 1 globe .
af: stel 'n nuwe stroombaan op met twee batterye en een gloeilamp .

source: explain how you connected the batteries so the globe still light up .
af: verduidelik hoe jy die batterye sal verbind sodat die lig steeds sal brand .

source: batteries had to be connected end to end with the positive side of one battery touching the negative side of the other battery .
af: batterye moet so gekoppel word dat die positiewe kant aan die negatiewe kant van die ander battery raak .

source: did the globe glow brighter or dimmer than in experiment 1 or did it glow the same ?
af: verduidelik of het die gloeilamp dieselfde helderder of flouer gebrand as in eksperiment 1 ?

source: brighter
af: helderder .

source: explain your answer to question 2 .
af: verduidelik jou antwoord op vraag 2 .

source: two batteries contain more stored energy than 1 battery more stored energy changes to more light energy
af: twee batterye bevat meer gestoorde energie as een battery meer gestoorde energie verander in meer ligenergie .

source: describe an electric circuit .
af: beskryf 'n elektriese stroombaan .

source: an electric circuit is a pathway that allows electricity to flow or a system that allows electrical energy to move .
af: 'n elektriese stroombaan is 'n baan wat elektrisiteit toelaat om te vloei of 'n sisteem wat elektrisiteit toelaat om te beweeg .

source: if you have access to the internet there is a wonderful site that allows you to build circuits and do experiments .
af: indien jy toegang tot die internet het is daar 'n wonderlike webwerf wat jou toelaat om stroombane te bou en om eksperimente te doen .

source: go to and see if you can build some circuits .
af: gaan na en kyk of jy 'n paar stroombane kan bou .

source: experiment to see how to make the globes burn brighter and dimmer .
af: eksperimenteer om te sien hoe die gloeilampe helderder en flouer brand .

source: batteries are actually made up of smaller parts known as cells that store chemical energy .
af: batterye bestaan eintlik uit kleiner deeltjies wat ons selle noem .

source: two or more cells connected end to end are called a battery .
af: selle stoor chemiese energie .

source: we will mostly refer to them as batteries but keep in mind that cell' is the scientific term for what most people call a battery in everyday life .
af: twee of meer selle wat kop aan kop gekoppel word vorm 'n battery .

source: one cell stores a small amount of energy .
af: ons praat meestal daarvan as batterye maar hou in gedagte dat die wetenskaplike term vir wat mense in die alledaagse lewe batterye noem eintlik 'sel' is .

source: if we need to store a lot of energy we use a battery .
af: een sel stoor 'n klein hoeveelheid energie .

source: a battery has stored energy which can provide electrical energy .
af: 'n battery het gestoorde energie wat omgeskakel kan word in elektriese energie maar ons huise skole winkels en fabrieke kan nie met batterye werk nie .

source: however our homes schools shops and factories cannot run on batteries .
af: ons gebruik elektrisiteit vir allerhande verskillende goed elke dag .

source: we use electricity for many different things every day .
af: die hoofbron van elektriese energie is kragstasies .

source: the main source of electrical energy is from power stations .
af: ons noem dit 'hoofstroom elektrisiteit' .

source: electricity generation video http www.youtube.com watch?v 20vb6hllqsg&amp;feature related
af: elektrisiteitsopwekking video . http www.youtube.com watch?v 20vb6hllqsg&amp;feature related

source: power stations use different ways to generate electricity .
af: kragstasies gebruik verskillende maniere om krag op te wek .

source: a power station needs a source of energy .
af: 'n kragstasie benodig 'n bron van energie .

source: in south africa most of our power stations burn coal to use the energy stored in coal to generate electricity .
af: in suid afrika brand die meeste kragstasies steenkool om die energie te gebruik wat in die steenkool gestoor word om elektrisiteit op te wek .

source: coal is not the only source of energy for power stations there are also other types of power stations .
af: steenkool is nie die enigste bron van energie vir kragstasies nie daar is ook ander tipes kragstasies .

source: find out what these are and write down what source of energy they each use .
af: vind uit wat dit is en skryf die bron van energie wat elkeen van hulle gebruik neer .

source: types of power stations include hydroelectric water geothermal steam and nuclear power stations nuclear .
af: hidro elektrisiteit water geotermiese stoom en kernkragstasies kernsplitsing .

source: from a power station electricity is transferred through transmission lines held up by pylons .
af: vanaf 'n kragstasie word elektrisiteit deur transmissiekabels oorgedra en hierdie kabels word deur reuse kragpale ondersteun .

source: the transmission lines are part of the circuit that connects the power stations to where we need to use the electricity .
af: die transmissiekabels vorm deel van die stroombaan wat die kragstasies verbind met die plekke waar elektrisiteit benodig word .

source: do you remember learning about the structures of pylons in gr. 4 in matter and materials ?
af: onthou jy dat julle in graad 4 oor die strukture van kragpale in materie en materiale geleer het ?

source: remember they are made from triangular shapes and struts to make them strong and stable !
af: onthou dat dit driehoekige vorms en stutte het om dit sterk en stabiel te maak !

source: making electricity from coal video http www.youtube.com watch?v ubtzwzrotdy and http www.youtube.com watch?v sexg8k5 uvu&amp;feature related
af: vervaardig elektrisiteit van steenkool video . http goo.gl hzu5v en http www.youtube.com watch?v sexg8k5 uvu&amp;feature related

source: the transmission lines carry large amounts of electricity to substations in cities and towns .
af: elektrisiteit word in 'n masiewe stroombaan na ons huise oorgedra .

source: from a substation electricity is carried in smaller amounts to an electricity box for our home .
af: van 'n substasie word elektrisiteit in kleiner hoveelhede vervoer na die elektrisiteitmeterkas van ons huis .

source: from the electricity box electricity travels through wires to the plug points and light fittings in our homes .
af: vandaar word dit deur die drade vervoer na die muurproppe en ligskakeleaars in ons huise .

source: the above diagram shows how electricity is transferred from the power station to your home .
af: die diagram hierbo wys vir ons hoe die elektrisiteit oorgedra word vanaf die kragstasie na jou huis .

source: continue the diagram use the space below to draw the path of electricity once it is in your home and goes through the wires wall socket and plugs to get to an appliance such as the tv .
af: voltooi die diagram gebruik die spasie hieronder om die pad van die elektrisiteit te teken van die oomblik wat dit in jou huis is en deur die drade muurprop en kragproppe na 'n apparaat soosdie tv gaan .

source: this is to assess the learner's ability to draw a flow diagram and translate words into pictures and text .
af: hierdie gedeelte toets die leerder se vermo&#235; om 'n vloeidiagram te teken en woorde in prentjies en teks te omskep .

source: interactive site about electricity http www.switchedonkids.org.uk where does.html
af: interaktiewe webblad oor elektrisiteit. goo.gl mrfiy

source: we use electricity every day .
af: ons gebruik elektrisiteit elke dag .

source: electricity can be dangerous so it is important that we use it safely .
af: elektrisiteit kan gevaarlik wees so dit is belangrik dat ons dit veilig gebruik .

source: electricity can give you an electric shock .
af: elektrisiteit kan vir jou 'n elektriese skok gee .

source: an electric shock can hurt you badly or even kill you .
af: 'n elektriese skok kan jou baie seer maak en jou selfs doodmaak .

source: electricity can cause fires and injuries even death .
af: elektrisiteit kan vure en beserings en selfs dood veroorsaak .

source: here are some rules for using electricity safely
af: hier is 'n paar re&#235;ls oor hoe om elektrisiteit veilig te gebruik .

source: why do torches need cells batteries to operate ?
af: hoekom benodig flitse selle batterye om te werk ?

source: cells battery are a source of energy for the torch .
af: selle batterye is 'n bron van energie vir die flits .

source: chemical energy is stored in the battery which is changed into electrical energy and then light energy as the light glows .
af: chemiese energie word gestoor in die battery en dit word omgeskakel na elektriese energie en dan ligenergie as die gloeilamp brand .

source: what is an electric circuit ?
af: wat is 'n elektriese stroombaan ?

source: how is a battery different to a cell ?
af: hoe verskil 'n sel van 'n battery ?

source: a battery is two or more cells connected end to end
af: 'n battery is twee of meer selle wat punt teen punt aan mekaar verbind is .

source: draw a diagram of a simple circuit containing one cell and one bulb so that the globe will glow .
af: teken 'n diagram van 'n eenvoudige stroombaan wat een sel en een gloeilamp bevat sodat die gloeilamp sal brand .

source: diagram as in workbook
af: diagram soos in werkboek .

source: how is it possible that electricity that is generated at a power station reaches a tv in a home that is far away from the power station ?
af: hoe is dit moontlik dat elektrisiteit opgewek kan word in 'n kragstasie en 'n televisie in die huis kan bereik wat ver weg is van die kragstasie ?

source: describe how the energy is transferred from a power station to your home .
af: verduidelik hoe die energie oorgedra word van die kragstasie na jou huis .

source: power station through transmission lines supported by pylons to substation .
af: die krag vloei van die kragstasie deur kraglyne wat ondersteun word deur kragpale na die substasie .

source: from substation through distribution lines to electricity box in your home .
af: vanaf die substasie vloei krag deur verspreidingskabels na die elektrisiteitsboks in jou huis .

source: from electricity box through wires in our homes to plug points and lights and appliances .
af: van die elektrisiteitsboks vloei dit deur drade in ons huis na kragpunte en ligte en toestelle .

source: when should you not handle electricity or electrical appliances ?
af: wanneer mag jy nie elektrisiteit of elektriese toestelle hanteer nie ?

source: when you are barefoot have wet hands or in the bathroom .
af: wanneer jy kaalvoet is nat hande het of in die badkamer is .

source: answer c
af: antwoord c

source: give a reason for the following statement 'do not play under or near power lines or electric fences' .
af: gee 'n rede vir die volgende stelling moenie onder of naby kraglyne of elektriese drade speel nie .

source: if the electricity fields are live i can get shocked even if just standing close to the electrical source .
af: as die elektriese velde lewendig is kan ek skok deur net naby aan die elektriese bron te staan .

source: this chapter is an introduction to stored potential energy and movement kinetic energy .
af: hierdie hoofstuk is 'n inleiding tot gestoorde potensi&#235;le energie en bewegings kinetiese energie .

source: although the proper terms are not used here you could introduce them in class so that learners start to become familiar with these words for the later grades .
af: alhoewel die regte terminologie nog nie hier gebruik word nie kan leerders al daaraan blootgestel word .

source: do you remember in gr. 4 when we looked at energy and movement in a system ?
af: onthou jy in graad 4 toe ons gekyk het na energie en beweging in 'n sisteem ?

source: we were mostly looking at musical instruments and how they use movement energy the input such as plucking or blowing to make them work .
af: ons het hoofsaaklik gekyk na musiekinstrumente en hoe dit gebruik word deur bewegingsenergie die inset soos tokkel of blaas om dit te laat werk .

source: in this chapter we are going to look some other ways of using stored energy to produce movement energy .
af: in hierdie hoofstuk gaan on kyk na sommige ander maniere waarop ons gestoorde energie kan gebruik om bewegingsenergie op te wek .

source: have you ever stretched an elastic band ?
af: het jy al ooit 'n rek uitgerek ?

source: when you pull it apart and then release it what happens ?
af: wanneer jy dit uitrek en dit dan los wat gebeur ?
